import java.util.Arrays;
import java.util.Random;
import java.util.Scanner;
/**
* С клавиатуры вводится кол-во элементов в массиве.
 * Создать массив указанной длины, заполнить его случайными числами от 0 до 10.
 * Распечатать массив, а также вывести в консоль информацию о:
 * а) Длине массива;
 * б) Количестве чисел больше 8;
 * в) Количестве чисел равных 1;
 * г) Количестве четных чисел;
 * д) Количестве нечетных чисел;
 * е) Сумме всех элементов массива.
 */
public class Task1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        int arrayLength = scanner.nextInt();

        Random random = new Random();
        int [] array = new int [arrayLength];
        for (int i = 0; i < array.length; i++)
            array[i] = random.nextInt(10);
        System.out.println(Arrays.toString(array));

        System.out.println(array.length);

        int counter8 = 0;
        for (int i = 0; i < array.length; i++) {
            if (array[i]>8)
                counter8++;
        }
        System.out.println(counter8);

        int counter1 = 0;
        for (int i = 0; i < array.length; i++) {
            if (array[i] == 1)
                counter1++;
        }
        System.out.println(counter1);

        int counterEven = 0;
        for (int i = 0; i < array.length; i++) {
            if (array[i] % 2 ==0)
                counterEven++;
        }
        System.out.println(counterEven);

        int counterOdd = 0;
        for (int i = 0; i < array.length; i++) {
            if (array[i] % 2 != 0)
                counterOdd++;
        }
        System.out.println(counterOdd);

        int sum = 0;
        for (int i = 0; i < array.length; i++) {
            sum += array[i];
        }
        System.out.println(sum);
    }
}
